import os, gettext
from src.OrderList import *
from PyQt5.QtCore import QSettings

def get_ac_data_list():
    set_dir = os.getcwd() + "\\settings\\settings.ini"
    setting = QSettings(set_dir, QSettings.IniFormat)

    lang_zh = gettext.translation('AcModbus', localedir=f'{os.getcwd()}\\locales', languages=[setting.value("language")])
    lang_zh.install('AcModbus')
    _ = lang_zh.gettext

    ac_data_list = {
        # 数据监控
        ac_monitor1:{
            # 地址下标，长度，倍率，发送地址，单位
            "系统电压":[0, 1, 1, "V"],
            "额定充电电流":[0, 1, 1, "A"],
            "额定放电电流":[1, 1, 1, "A"],
            "产品类型":[1, 1, 1, "", {
                '33': _('AC-DC 充电器'),
                '32': _('DC-DC 充电器')
                }],
            "产品规格":[2, 8, 1, ""],
            "软件版本":[10, 2, 1, ""],
            "硬件版本":[12, 2, 1, ""],
            "产品序列号":[14, 2, 1, ""],
            "设备地址":[16, 1, 1, ""],
            # "BMS协议选择":[17, 1, 1, ""],
            # "RS485协议版本":[18, 2, 1, ""],
            # "生产日期":[20, 2, 1, ""],
            # "产地编码":[22, 1, 1, ""],
            # "软件编译时间":[23, 20, 1, ""],
            # "产品序列号字符":[43, 20, 1, ""],
            "设备名称":[63, 32, 1, ""],
        },
        # 数据监控2
        ac_monitor2:{
            # 地址下标，长度，倍率，单位
            # "蓄电池电流SOC":[0, 1, 1, "%"],
            "蓄电池电压":[1, 1, 10, "V"],
            "充电电流":[2, 1, 100, "A"],
            "设备温度":[3, 1, 1, "℃"],
            "蓄电池温度":[3, 1, 1, "℃"],
            # "保留":[4, 3, 1, "℃"],
            # "输入电压":[7, 1, 1, "℃"],
            # "保留":[8, 1, 1, "℃"],
            "充电功率":[9, 1, 1, "W"],
            # "保留":[10, 1, 1, "℃"],
            # "蓄电池当天最低电压":[11, 1, 1, "℃"],
            # "蓄电池当天最高电压":[12, 1, 1, "℃"],
            # "当天充电最大电流":[13, 1, 1, "℃"],
            # "保留":[14, 1, 1, "℃"],
            # "当天充电最大功率":[15, 1, 1, "℃"],
            # "保留":[16, 1, 1, "℃"],
            # "当天充电安时数":[17, 1, 1, "℃"],
            # "保留":[18, 1, 1, "℃"],
            # "当天发电量":[19, 1, 1, "℃"],
            # "保留":[20, 1, 1, "℃"],
            # "总运行天数":[21, 1, 1, "℃"],
            # "蓄电池总过放次数":[22, 1, 1, "℃"],
            # "蓄电池总充满次数":[23, 1, 1, "℃"],
            # "蓄电池总充电安时数":[24, 2, 1, "℃"],
            # "保留":[26, 2, 1, "℃"],
            # "累计发电量":[28, 2, 1, "℃"],
            # "保留":[30, 2, 1, "℃"],
            "充电状态":[32, 1, 1, "", {
                "00": _("空闲"),
                "01": _("测试充电"),
                "02": _("大电流充电"),
                "03": _("均衡充电"),
                "04": _("提升充电"),
                "05": _("浮充充电"),
                "06": _("限流充电"),
                "07": _("充满"),
                "08": _("储存充电"),
                "09": _("电源模式输出"),
                }],
            "故障/告警信息":[33, 2, 1, "", {
                "7": _("未接蓄电池"),
                "11": _("设备低温保护"),
                },{
                    "1": _("输出超压保护"),
                    "5": _("高温限流"),
                    "6": _("高温保护"),
                    "13": _("过流保护"),
                    }],
        },
        # 参数设置
        ac_get_setting:{
            # 地址下标，长度，倍率，发送地址，最小值，最大值
            "充电电流设置(A)":[0, 1, 100, "e001", 0, 25],
            "蓄电池标称容量(AH)":[1, 1, 1, "e002", 0, 9999],
            "系统电压设置(V)":[2, 1, 1, "e003", 12, 255],
            "蓄电池类型":[3, 1, 1, "e004", 0, 11],
            "超压电压(V)":[4, 1, 10, "e005", 9, 17],
            "充电限制电压(V)":[5, 1, 10, "e006", 9, 17],
            "均衡充电电压(V)":[6, 1, 10, "e007", 9, 17],
            "提升充电电压(V)":[7, 1, 10, "e008", 9, 17],
            "浮充充电电压(V)":[8, 1, 10, "e009", 9, 17],
            "储存充电电压(V)":[9, 1, 10, "e00a", 9, 17],
            # "过放返回电压":[10, 1, 1, ""],
            # "欠压警告电压":[11, 1, 1, ""],
            # "过放电压":[12, 1, 1, ""],
            # "放电限制电压":[13, 1, 1, ""],
            # "充电截止soc,放电截止soc":[14, 1, 1, ""],
            # "过放延时时间":[15, 1, 1, ""],
            "均衡充电时间(min)":[16, 1, 1, "e011", 0, 60],
            "提升充电时间(min)":[17, 1, 1, "e012", 10, 600],
            "均衡充电间隔(day)":[18, 1, 1, "e013", 0, 255],
            "温度补偿系数(mV/℃/2V)":[19, 1, 1, "e014", 0, 5],
            # "电池充电上限温度":[20, 1, 1, "℃"],
            "电池充电下限温度(℃)":[21, 1, 1, "e016", -35, 10],
            # "保留1":[22, 5, 1, ""],
            "充满截止电流(A)":[27, 1, 1, "e01c", 0, 10],
            # "保留2":[28, 19, 1, ""],
            "充满截止延时(S)":[47, 1, 1, "e030", 0, 600],
            "锂电池零度禁止充":[48, 1, 1, "e031", 0, 1],
            # "退出存储充电的电流":[49, 1, 1, ""],
            # "测试模式电流百分比":[50, 1, 1, ""],
            "充电模式":[51, 1, 1, "e034", 0, 1],
            # "充电模式的启动充电电压":[52, 1, 1, ""],
            # "充电模式的停止充电电压":[53, 1, 1, ""],
            "电源模式输出使能":[54, 1, 1, "e037", 0, 1],
            "电源模式输出电压":[55, 1, 10, "e038", 10, 30],
            "电源模式启动充电电压":[56, 1, 10, "e039", 11, 17],
            "电源模式停止充电电压":[57, 1, 10, "e03a", 10, 16],
        }
    }
    return ac_data_list