from src.i18n.Bms_i18n import *
from src.OrderList import *

def get_bms_rs485_list():
    bms_rs485_list = {
        "获取PACK模拟量响应信息":{
            "Command":[0, 4, 1, ""],
            "电池单体个数":[4, 4, 1, ""],
            "Cell电压_1":[8, 8, 1, "mV"],
            "Cell电压_2":[16, 8, 1, "mV"],
            "Cell电压_3":[24, 8, 1, "mV"],
            "Cell电压_4":[32, 8, 1, "mV"],
            "Cell电压_5":[40, 8, 1, "mV"],
            "Cell电压_6":[48, 8, 1, "mV"],
            "Cell电压_7":[56, 8, 1, "mV"],
            "Cell电压_8":[64, 8, 1, "mV"],
            "Cell电压_9":[72, 8, 1, "mV"],
            "Cell电压_10":[80, 8, 1, "mV"],
            "Cell电压_11":[88, 8, 1, "mV"],
            "Cell电压_12":[96, 8, 1, "mV"],
            "Cell电压_13":[104, 8, 1, "mV"],
            "Cell电压_14":[112, 8, 1, "mV"],
            "Cell电压_15":[120, 8, 1, "mV"],
            "Cell电压_16":[128, 8, 1, "mV"],
            "监测温度个数":[136, 4, 1, ""],
            "温度_1":[140, 8, -1, "℃"],
            "温度_2":[148, 8, -1, "℃"],
            "温度_3":[156, 8, -1, "℃"],
            "温度_4":[164, 8, -1, "℃"],
            "温度_5":[172, 8, -1, "℃"],
            "温度_6":[180, 8, -1, "℃"],
            "温度_7":[188, 8, -1, "℃"],
            "温度_8":[196, 8, -1, "℃"],
            "温度_9":[204, 8, -1, "℃"],
            "PACK电流":[212, 8, -1, "mV"],
            "PACK总电流":[220, 8, -1, "mV"],
            "PACK剩余容量":[228, 8, 1, "AH"],
            "用户自定义个数":[236, 4, 1, ""],
            "PACK充满容量":[240, 8, 1, "AH"],
            "充放电循环次数":[248, 8, 1, ""],
            "PACK设计容量":[256, 8, 1, "AH"],
            "PACK SOC":[264, 8, 1, "%"]
        },
        "获取PACK告警量":{
            "Command":[0, 4, 1, ""],
            "电池单体告警个数":[4, 4, 1, ""],
            "Cell告警_1":[8, 4, 1, ""],
            "Cell告警_2":[12, 4, 1, ""],
            "Cell告警_3":[16, 4, 1, ""],
            "Cell告警_4":[20, 4, 1, ""],
            "Cell告警_5":[24, 4, 1, ""],
            "Cell告警_6":[28, 4, 1, ""],
            "Cell告警_7":[32, 4, 1, ""],
            "Cell告警_8":[36, 4, 1, ""],
            "Cell告警_9":[40, 4, 1, ""],
            "Cell告警_10":[44, 4, 1, ""],
            "Cell告警_11":[48, 4, 1, ""],
            "Cell告警_12":[52, 4, 1, ""],
            "Cell告警_13":[56, 4, 1, ""],
            "Cell告警_14":[60, 4, 1, ""],
            "Cell告警_15":[64, 4, 1, ""],
            "Cell告警_16":[68, 4, 1, ""],
            "监测温度告警个数":[72, 4, 1, ""],
            "温度告警_1":[76, 4, 1, ""],
            "温度告警_2":[80, 4, 1, ""],
            "温度告警_3":[84, 4, 1, ""],
            "温度告警_4":[88, 4, 1, ""],
            "温度告警_5":[92, 4, 1, ""],
            "温度告警_6":[96, 4, 1, ""],
            "温度告警_7":[100, 4, 1, ""],
            "温度告警_8":[104, 4, 1, ""],
            "温度告警_9":[108, 4, 1, ""],
            "PACK充电电流告警":[112, 4, 1, ""],
            "PACK总电压告警":[116, 4, 1, ""],
            "PACK放电电流告警":[120, 4, 1, ""],
            "保护状态_1":[124, 4, 1, "", {
                "0":"单体过压保护",
                "1":"单体过放保护",
                "2":"总压过压保护",
                "3":"总压过放保护",
                "4":"充电过流保护",
                "5":"放电过流保护",
                "6":"短路"
            }],
            "保护状态_2":[128, 4, 1, "", {
                "0":"充电高温保护",
                "1":"放电高温保护",
                "2":"充电低温保护",
                "3":"放电低温保护",
                "4":"MOS高温保护",
                "5":"环境高温保护",
                "6":"环境低温保护",
                "7":"Fully充满"
            }],
            "指示状态":[132, 4, 1, "", {
                "0":"限流",
                "1":"CFET",
                "2":"DFET",
                "3":"Pack供电",
                "4":"充电器反接",
                "5":"ACin",

                "7":"加热膜"
                }],
            "控制状态":[136, 4, 1, "", {
                "0":"蜂鸣器告警",

                "4":"充电限流",
                "5":"LED告警"
            }],
            "故障状态":[140, 4, 1, "", {
                "0":"充电MOS故障",
                "1":"放电MOS故障",
                "2":"温度传感器故障",
                
                "4":"电芯故障",
                "5":"采样故障"
            }],
            "均衡状态_1":[144, 4, 1, ""],
            "均衡状态_2":[148, 4, 1, ""],
            "告警状态_1":[152, 4, 1, "", {
                "0":"单体过压",
                "1":"单体低压",
                "2":"总压过压",
                "3":"总压低压",
                "4":"充电过流",
                "5":"放点过流"
            }],
            "告警状态_2":[156, 4, 1, "", {
                "0":"充电高温",
                "1":"放电高温",
                "2":"充电低温",
                "3":"放点低温",
                "4":"环境高温",
                "5":"环境低温",
                "6":"MOS高温",
                "7":"低电量"
            }]
        }
    }
    return bms_rs485_list