from src.OrderList import *

ac_data_list = {
    # 产品信息区
    ivpo_product_msg:{
        # 地址下标，长度，倍率，单位
        '系统电压':[0, 1, 1, ''],
        '产品类型':[1, 1, 1, ''],
        '产品型号':[2, 8, 1, ''],
        '软件版本':[10, 2, 1, ''],
        '硬件版本':[12, 2, 1, ''],
        '产品序列号':[14, 2, 1, ''],
        '设备地址':[16, 1, 1, ''],
        # '机型编码':[17, 1, 1, ''],
        # 'RS485版本':[18, 2, 1, ''],
        # '生产日期':[20, 2, 1, ''],
        # '产地编码':[22, 1, 1, ''],
        # '软件编译时间':[23, 20, 1, ''],
        # '产品序列号字符串':[43, 20, 1, ''],
        '设备名称':[63, 32, 1, ''],
        # '保留':[95, 3, 1, ''],
    },
    # 控制器数据区
    ivpo_control_msg:{
        '蓄电池SOC':[0, 1, 1, ''],
        '蓄电池电压':[1, 1, 1, ''],
        '充电电流':[2, 1, 1, ''],
        '充电状态':[3, 1, 1, ''],
        
    },
    # 逆变数据区
    ivpo_ivt_msg:{
        
    },
    # 用户设置区1
    ivpo_setting1:{
        
    },
    # 用户设置区2
    ivpo_setting2:{
        
    }
}